{"data":{"site":{"siteMetadata":{"title":"Jeff Rafter"}},"allMarkdownRemark":{"edges":[{"node":{"excerpt":"Furby is probably the most advanced, well designed, impossibly elegant child’s toy that exists. They might be the key to unlocking the the emotion of pair-programming. It might seem like the stuff of nightmares: these small talking robots dancing and singing and clamoring for your attention, but as a developer or user experience designer it is an almost perfect medium. The Original Furby The Furby was originally released in  _ _ _ _ . That Christmas it was the toy to have and inspired the movie Jingle All the Way with Arnold Schwarzeneggar and Sinbad. Not many toys can claim that. The original Furby was a marvel. The source code The furby organ The furby secret audio language Furby Connect Hasbro released the Furby Connect in 2012. Mad hordes of shoppers weren’t tackling one another in the aisles to purchase the last one. If only the shoppers had understood the power. The Furby Connect is a dancing, singing robotic toy much like its predecessor. Hacknight Furbies Hack-week","fields":{"slug":"/furbies/"},"frontmatter":{"date":"June 28, 2019","title":"More Than You Ever Wanted to Know About Furbies","excerpt":"Furby is probably the most advanced, well designed, impossibly elegant child's toy that exists. They might be the key to unlocking the the emotion of pair-programming."}}},{"node":{"excerpt":"Everything you know about berries is probably wrong. Unless you know a lot about berries; then you know why it needs to be discussed. It turns out that what the botanists think about berries and what your mom told you have almost nothing in common. Berries & Lightning Talks At an internal GitHub summit in Boston in January 2018 , there\nwas an opporunity to give lightning talks. I was told I needed to give one about twenty minutes before they were meant to begin. Corey Hobbs, Nick Hengeveld, Mike Coutermarsh and I had eaten lunch just before and the subject of berries came up. We had even searched the web for examples (credit @nickh with finding several of these). I thought it would make a good talk and put it together as quickly as possible. Challenge Your Assumptions We operate on a set of learned societal norms, both inside and outside of the echo chambers of Silicon Valley. If a Strawberry can be a fleshy substrate while a banana is a berry then what other misguided assumptions have we been working under? Whose definitions and terminology are we relying on?","fields":{"slug":"/berries/"},"frontmatter":{"date":"June 28, 2019","title":"About Berries","excerpt":"Everything you know about berries is probably wrong. Unless you know a lot about berries; then you know why it needs to be discussed."}}},{"node":{"excerpt":"Everything you know about berries is probably wrong. Unless you know a lot about berries; then you know why it needs to be discussed. It turns out that what the botanists think about berries and what your mom told you have almost nothing in common. Berries & Lightning Talks At an internal GitHub summit in Boston in January 2018 , there\nwas an opporunity to give lightning talks. I was told I needed to give one about twenty minutes before they were meant to begin. Corey Hobbs, Nick Hengeveld, Mike Coutermarsh and I had eaten lunch just before and the subject of berries came up. We had even searched the web for examples (credit @nickh with finding several of these). I thought it would make a good talk and put it together as quickly as possible. Challenge Your Assumptions We operate on a set of learned societal norms, both inside and outside of the echo chambers of Silicon Valley. If a Strawberry can be a fleshy substrate while a banana is a berry, what other misguided assumptions have we been working under? Whose definitions and terminology are we relying on?","fields":{"slug":"/oculus-quest/"},"frontmatter":{"date":"June 28, 2019","title":"Developing for the Oculus Quest","excerpt":"Everyone wants to talk about consumer VR. I just want to make some games."}}},{"node":{"excerpt":"Creating a static website involves an almost infinite set of choices. Among these is\n Gatsby  – a static site framework based on  ,  ,   and\nmany other modern approaches. Gatsby is, in many ways, the JavaScript successor to\n Jekyll . I’ve upgraded several sites to Gatsby (including this one) finding\na way to integrate TypeScript as part of the journey. Before you read this it is important to point out: you should start with a template. In this post I\nam going to work through all of the steps and try to explain them along the way. Included\nin this post are some of the reasons behind why I’ve chosen one particular plugin or skipped\nanother. Often – especially when you choose a default Gatsby starter – it is difficult to understand\nhow all of the pieces fit together, or how you might build your own starter template. Hopefully\nthis post provides some helpful examples. Also: the Gatsby  documentation  is extremely good. There is a\nfantastic  tutorial ,  quick start  and some recipes. I’ve relied on those and a host of other blogs when working on this\npost. In order to follow this, you’ll need access to a terminal (or console) and you’ll need Node, Node Version Manager, and git installed. All of the code (and commits) are availble on GitHub:  https://github.com/example-gatsby-typescript-blog/example-gatsby-typescript-blog.github.io Getting started First you want to create a folder for your project: We’ll be using Gatsby which is a toolkit that is written in TypeScript and requires Node. If you have multiple local projects you might run into a conflict about which Node version should be used. Node Version Manager solves this problem. To control which version of Node should be used in your project, add an   file: The file is pretty simple; just the version. At the time you read this there may be a newer version of Node. You can check  https://nodejs.org . Ignore some things We plan to use   to keep track of our changes. As we work on our project locally, there will be a lot of files we won’t want to keep track of; we’ll want to ignore them. To do this we’ll create a new file called    . These files can be very short and specific, or they can be very long and general. We’ll use a more generic one that will work on different kinds of computers. If you are looking for an example   you can check out  https://github.com/github/gitignore . For now, just copy the following: Configure your editor This section is completely optional. This is here mostly so I can copy and…","fields":{"slug":"/gatsby-with-typescript/"},"frontmatter":{"date":"May 25, 2019","title":"Building a Static Gatsby-based Website with TypeScript","excerpt":"Creating a static website involves an almost infinite set of choices. I've upgraded several sites to Gatsby (including this one) finding a way to integrate TypeScript as part of the journey. Gatsby leverages React, JSX, CSS-in-JS, GraphQL and many other modern approaches to building sites."}}}]}},"pageContext":{}}